In [2]:
# *********************************************INDEXING:
# MULTIINDEX SERIES:
import pandas as pd
import numpy as np

rng=np.random.RandomState(0)
s=pd.Series(rng.randn(9),
           index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 3, 1, 2, 2, 3]])
s

a  1    1.764052
   2    0.400157
   3    0.978738
b  1    2.240893
   3    1.867558
c  1   -0.977278
   2    0.950088
d  2   -0.151357
   3   -0.103219
dtype: float64

In [9]:
s.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [11]:
# slicing using "outer" level:
s['b':'c']

b  1    2.240893
   3    1.867558
c  1   -0.977278
   2    0.950088
dtype: float64

In [14]:
# slicing using "inner" level:
s.loc[:, 2]

a    0.400157
c    0.950088
d   -0.151357
dtype: float64

In [15]:
# reshaping:
s.unstack()

          1         2         3
a  1.764052  0.400157  0.978738
b  2.240893       NaN  1.867558
c -0.977278  0.950088       NaN
d       NaN -0.151357 -0.103219

In [16]:
s.unstack().stack()  # coming back to the previous shape

a  1    1.764052
   2    0.400157
   3    0.978738
b  1    2.240893
   3    1.867558
c  1   -0.977278
   2    0.950088
d  2   -0.151357
   3   -0.103219
dtype: float64

In [18]:
# MULTIINDEX DATAFRAME (both axes):
df=pd.DataFrame(rng.randn(12).reshape(4,3),
               index=[['a', 'a', 'b', 'b'],[1,2,1,2]],
               columns=[['Ohio', 'Ohio', 'Colorado'],
                       ['Green', 'Red', 'Green']])
df

         Ohio            Colorado
        Green       Red     Green
a 1  0.410599  0.144044  1.454274
  2  0.761038  0.121675  0.443863
b 1  0.333674  1.494079 -0.205158
  2  0.313068 -0.854096 -2.552990

In [19]:
# adding names to the hierarchical levels:
df.index.names=['key1', 'key2']
df.columns.names=['state', 'color']
df

state          Ohio            Colorado
color         Green       Red     Green
key1 key2
a    1     0.410599  0.144044  1.454274
     2     0.761038  0.121675  0.443863
b    1     0.333674  1.494079 -0.205158
     2     0.313068 -0.854096 -2.552990

In [20]:
df['Ohio']

color         Green       Red
key1 key2
a    1     0.410599  0.144044
     2     0.761038  0.121675
b    1     0.333674  1.494079
     2     0.313068 -0.854096

In [25]:
df.loc['a']

state      Ohio            Colorado
color     Green       Red     Green
key2
1      0.410599  0.144044  1.454274
2      0.761038  0.121675  0.443863

In [26]:
# reordering levels:
df.swaplevel('key1', 'key2')

state          Ohio            Colorado
color         Green       Red     Green
key2 key1
1    a     0.410599  0.144044  1.454274
2    a     0.761038  0.121675  0.443863
1    b     0.333674  1.494079 -0.205158
2    b     0.313068 -0.854096 -2.552990

In [30]:
df2=df.swaplevel('key1', 'key2')
df2.swaplevel('key1', 'key2')  # returns to the original state

state          Ohio            Colorado
color         Green       Red     Green
key1 key2
a    1     0.410599  0.144044  1.454274
     2     0.761038  0.121675  0.443863
b    1     0.333674  1.494079 -0.205158
     2     0.313068 -0.854096 -2.552990

In [31]:
# summary statistics:
df.sum(level='key2')

state      Ohio            Colorado
color     Green       Red     Green
key2
1      0.744273  1.638123  1.249115
2      1.074105 -0.732421 -2.109127

In [33]:
df.sum(level='color', axis=1) # refering to the column levels the axis=1 parameter must be added

color         Green       Red
key1 key2
a    1     1.864872  0.144044
     2     1.204901  0.121675
b    1     0.128516  1.494079
     2    -2.239922 -0.854096

In [43]:
# defining index after df creation:
df3 = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
    'c': ['one', 'one', 'one', 'two', 'two',
    'two', 'two'],
    'd': [0, 1, 2, 0, 1, 2, 3]})
df3

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [46]:
df4=df3.set_index(['c', 'd'], drop=False) # drop=False - allows to keep columns converted to the indexes as a part of df
df4

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [52]:
# ************************************************COMBINING AND MERGING DATASETS;
# join -> is using index by default (columns are from both tables)
# merge -> is using common column (detected automatically by the same col name or defined in "on" parameter)

df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})

print(df1)
print(df2)

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6
  key  data2
0   a      0
1   b      1
2   d      2

In [50]:
pd.merge(df1, df2)  # like inner join, automatically detects common column, or might be specified in the on='col_name' parameter

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [53]:
# dfs with different name of common column - adding left/right_on:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})
pd.merge(df3, df4, left_on='lkey', right_on='rkey')  # if key column in one table is the index column at the same time,
                                                    # instead of righ/left_on use right/left_index=True

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [55]:
df3.join(df4) # merges by index

  lkey  data1 rkey  data2
0    b      0    a    0.0
1    b      1    b    1.0
2    a      2    d    2.0
3    c      3  NaN    NaN
4    a      4  NaN    NaN
5    a      5  NaN    NaN
6    b      6  NaN    NaN

In [56]:
# concatenation - by default adds rows:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [57]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [61]:
# concat with creation multiindex by adding keys parameter:
x=pd.concat([s1,s1,s3], keys=['one', 'two', 'three'])
x

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [62]:
x.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [63]:
# COMBINE_FIRST - where index in both df/series is the same or is overlapping
#               - the null values in the primary object will be filled with values from the object passed as the parameter
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                    'b': [np.nan, 2., np.nan, 6.],
                    'c': range(2, 18, 4)})
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                    'b': [np.nan, 3., 4., 6., 8.]})

df1.combine_first(df2) # nulls from df1 are filled with corresponding values from df2

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [64]:
df=pd.DataFrame(np.arange(6).reshape(2,3),
               index=pd.Index(['Ohio', 'Colorado'], name='state'),
               columns=pd.Index(['one', 'two', 'three'], name='numbers'))
df

numbers   one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [70]:
df_stacked=df.stack()
df_stacked  # stacked df => new df with multiindex

state     numbers
Ohio      one        0
          two        1
          three      2
Colorado  one        3
          two        4
          three      5
dtype: int32

In [71]:
# by default the innermost level is stacked/unstacked, it might be customized by providing name/index as a parameter
df_stacked.unstack('state')  #by default would be unstacked 'numbers'

state    Ohio  Colorado
numbers
one         0         3
two         1         4
three       2         5

In [73]:
df_stacked.unstack()

numbers   one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [77]:
#*********************************************PIVOTING LONG TO WIDE FORMAT:
df=pd.read_csv('https://raw.githubusercontent.com/justkacz/csvfiles/main/macrodata.csv')
df.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [119]:
# reshaping raw df to get date (format: year, month, day)-item-value:
new_index=pd.PeriodIndex(year=df.year, quarter=df.quarter)
new_col=pd.Index(['realgdp', 'infl', 'unemp'], name='item')
s2=df.reindex(columns=new_col) 
s2.index=new_index.to_timestamp('D', 'end')  # adding day, month- as the last day, month of each quarter
s2.head()

item                            realgdp  infl  unemp
1959-03-31 23:59:59.999999999  2710.349  0.00    5.8
1959-06-30 23:59:59.999999999  2778.801  2.34    5.1
1959-09-30 23:59:59.999999999  2775.488  2.74    5.3
1959-12-31 23:59:59.999999999  2785.204  0.27    5.6
1960-03-31 23:59:59.999999999  2847.699  2.31    5.2

In [150]:
df4=s2.stack() # stack has added multiindex: date and item
df4=df4.reset_index().rename(columns={'level_0':'date', 0: 'value'})
# or:
#df4=df4.reset_index()
#df4.columns=(['date', 'item', 'value'])

df4.head()

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340

LONG FORMAT:

long format -> for multiple time series, or other observational data with two or more keys (here, the keys are date and item). Each row in the table represents a single observation.

In [130]:
# PIVOT = values from item spread as columns:
pivoted=df4.pivot(index='date', columns='item', values='value')
pivoted.head()

item                           infl   realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349    5.8
1959-06-30 23:59:59.999999999  2.34  2778.801    5.1
1959-09-30 23:59:59.999999999  2.74  2775.488    5.3
1959-12-31 23:59:59.999999999  0.27  2785.204    5.6
1960-03-31 23:59:59.999999999  2.31  2847.699    5.2

In [132]:
# df4['value2']=rng.randn(len(df4))
pivoted2=df4.pivot(index='date', columns='item') # by omitting the 'values' parameter the df will get hierarchical columns 
pivoted2.head()

                              value
item                           infl   realgdp unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2

In [158]:
# the same result as pivot: set_index followed by unstack:
pivoted3=df4.set_index(['date','item'])
pivoted3.unstack().head() # by default innermost level => 'item'

                              value
item                           infl   realgdp unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2

In [ ]:
# ************************************************PIVOTING